public class lesson_01 {
    //Полиморфизм и переопределение

    //1) Переопределение метода.
    //Представь, что ты для игры написал класс «Корова». В нем есть много полей и методов.
    //Объекты этого класса могут делать разные вещи: идти, есть, спать.
    //Еще коровы звонят в колокольчик, когда ходят. Допустим, ты реализовал в классе все до мелочей.

    //А тут приходит заказчик проекта и говорит, что хочет выпустить новый уровень игры,
    //где все действия происходят в море, а главным героем будет кит.

    //Ты начал проектировать класс «Кит» и понял, что он лишь немного отличается от класса «Корова».
    //Логика работы обоих классов очень похожа, и ты решил использовать наследование.

    //Класс «Корова» идеально подходит на роль класса-родителя, там есть все необходимые переменные и методы.
    //Достаточно только добавить киту возможность плавать. Но есть проблема: у твоего кита есть ноги, рога и колокольчик.
    //Ведь эта функциональность реализована внутри класса «Корова». Что тут можно сделать?


}
